## Data manipulation project

In [4]:
import pandas as pd
pd.set_option('display.max_colwidth', -1)

<ipython-input-4-fd0b9af24538>:2: FutureWarning: Passing a negative integer is deprecated in version 1.0 and will not be supported in future version. Instead, use None to not limit the column width.
  pd.set_option('display.max_colwidth', -1)

In [5]:
jeopardy = pd.read_csv('jeopardy.csv')

In [6]:
jeopardy.head()

,Show Number,Air Date,Round,Category,Value,Question,Answer
0,4680,2004-12-31,Jeopardy!,HISTORY,$200,"For the last 8 years of his life, Galileo was under house arrest for espousing this man's theory",Copernicus
1,4680,2004-12-31,Jeopardy!,ESPN's TOP 10 ALL-TIME ATHLETES,$200,"No. 2: 1912 Olympian; football star at Carlisle Indian School; 6 MLB seasons with the Reds, Giants & Braves",Jim Thorpe
2,4680,2004-12-31,Jeopardy!,EVERYBODY TALKS ABOUT IT...,$200,"The city of Yuma in this state has a record average of 4,055 hours of sunshine each year",Arizona
3,4680,2004-12-31,Jeopardy!,THE COMPANY LINE,$200,"In 1963, live on ""The Art Linkletter Show"", this company served its billionth burger",McDonald's
4,4680,2004-12-31,Jeopardy!,EPITAPHS & TRIBUTES,$200,"Signer of the Dec. of Indep., framer of the Constitution of Mass., second President of the United States",John Adams

In [4]:
jeopardy.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 216930 entries, 0 to 216929
Data columns (total 7 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Show Number  216930 non-null  int64
 1    Air Date    216930 non-null  object
 2    Round       216930 non-null  object
 3    Category    216930 non-null  object
 4    Value       216930 non-null  object
 5    Question    216930 non-null  object
 6    Answer      216928 non-null  object
dtypes: int64(1), object(6)
memory usage: 11.6+ MB

In [7]:
data = jeopardy.rename(columns = {' Air Date': 'Air_Date', ' Round': 'Round', ' Category': 'Category', ' Value': 'Value', ' Question': 'Question', ' Answer': 'Answer'})
data.head()

,Show Number,Air_Date,Round,Category,Value,Question,Answer
0,4680,2004-12-31,Jeopardy!,HISTORY,$200,"For the last 8 years of his life, Galileo was under house arrest for espousing this man's theory",Copernicus
1,4680,2004-12-31,Jeopardy!,ESPN's TOP 10 ALL-TIME ATHLETES,$200,"No. 2: 1912 Olympian; football star at Carlisle Indian School; 6 MLB seasons with the Reds, Giants & Braves",Jim Thorpe
2,4680,2004-12-31,Jeopardy!,EVERYBODY TALKS ABOUT IT...,$200,"The city of Yuma in this state has a record average of 4,055 hours of sunshine each year",Arizona
3,4680,2004-12-31,Jeopardy!,THE COMPANY LINE,$200,"In 1963, live on ""The Art Linkletter Show"", this company served its billionth burger",McDonald's
4,4680,2004-12-31,Jeopardy!,EPITAPHS & TRIBUTES,$200,"Signer of the Dec. of Indep., framer of the Constitution of Mass., second President of the United States",John Adams

In [6]:
#Write a function that filters the dataset for questions that contains all of the words in a list of words.

In [8]:
#x is each question

def filter_data(data, column, words):
    filter = lambda x: all(word.lower() in x.lower() for word in words)
    return data.loc[data[column].apply(filter)]


filtered = filter_data(data, 'Question', ["King", "England"])

print(filtered["Question"])

4953      Both England's King George V & FDR put their stamp of approval on this "King of Hobbies"
6337      In retaliation for Viking raids, this "Unready" king of England attacks Norse areas of the Isle of Man
9191      This king of England beat the odds to trounce the French in the 1415 Battle of Agincourt
11710     This Scotsman, the first Stuart king of England, was called "The Wisest Fool in Christendom"
13454     It's the number that followed the last king of England named William
                                          ...
208295    In 1066 this great-great grandson of Rollo made what some call the last Viking invasion of England
208742    Dutch-born king who ruled England jointly with Mary II & is a tasty New Zealand fish
213870    In 1781 William Herschel discovered Uranus & initially named it after this king of England
216021    His nickname was "Bertie", but he used this name & number when he became king of England in 1901
216789    This kingdom of England grew from 2 settlements, one founded around 495 by Cerdic & his son Cynric
Name: Question, Length: 152, dtype: object

In [9]:
def count_words(data, column):
  return data[column].value_counts()

In [10]:
count_words(data, 'Question')

[audio clue]                                                                                   17
[video clue]                                                                                   14
(audio clue)                                                                                   5
[filler]                                                                                       5
Hainan                                                                                         4
                                                                                              ..
"Pearl"                                                                                        1
Country that manufactures the most cars per year                                               1
Majorca & Malta                                                                                1
Developed in Louisiana, praline is a sweet traditionally made with brown sugar & these nuts    1
Act One, "Daily Life": Stage manager: "My God, is this place boring"                           1
Name: Question, Length: 216124, dtype: int64

In [13]:
# Adding a new column. If the value of the float column is not "None", 
# then we cut off the first character (which is a dollar sign),
# and replace all commas with nothing, and then cast that value to a float. 
# If the answer was "None", then we just enter a 0.

data['Float value'] = data['Value'].apply(lambda x : float(x[1:].replace(',','')) if x !='None' else 0)

In [17]:
filtered = filter_data(data, 'Question', ["King"])

print(filtered["Float value"].mean())

771.8833850722094

In [18]:
# A function to find the unique answers of a set of data

def get_answer_counts(data):
    return data['Answer'].value_counts()

In [19]:
print(get_answer_counts(filtered))

Henry VIII                55
Solomon                   35
Richard III               33
Louis XIV                 31
David                     30
                          ..
Allan Quatermain          1
Jesus Christ Superstar    1
a governess               1
anodes                    1
burros                    1
Name: Answer, Length: 5268, dtype: int64